## Assignment__DataCleaning

## It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

## Take this monstrosity as the DataFrame to use in the following puzzles:

## df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',

## 'Budapest_PaRis', 'Brussels_londOn'], 'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 'RecentDelays': [[23,47], [], [24,43,87], [13], [67,32]], 'Airline': ['KLM(!)', Air France>(12)',

## '(British Airways.)', '12. Air France', 'Swiss Air']})

## 1. Some values in the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column)

In [33]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
                  'FlightNumber':[10045, np.nan, 10065, np.nan, 10085],'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                  'Airline':['KLM(!)','<Air France>(12)','(British Airways.)','12.Air France', 'Swiss Air']})

df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]       12.Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [34]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [35]:
df['FlightNumber']

0    10045.0
1        NaN
2    10065.0
3        NaN
4    10085.0
Name: FlightNumber, dtype: float64

In [36]:
# Setting up new index for the dataframe. This index is used for the for loop iteration created in the next step
newindex = np.arange(1, df.From_To.count()+1)
newindex

array([1, 2, 3, 4, 5])

In [37]:
df.set_index(newindex, inplace=True)
df

            From_To  FlightNumber  RecentDelays             Airline
1      LoNDon_paris       10045.0      [23, 47]              KLM(!)
2      MAdrid_miLAN           NaN            []    <Air France>(12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
4    Budapest_PaRis           NaN          [13]       12.Air France
5   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [38]:
# Using for loop for iteration along with isnull function to update the values for column FlightNumber

for i in np.arange(1, df.From_To.count()+1):
    if pd.isnull(df.FlightNumber.loc[i,]):
        df.loc[i,'FlightNumber'] = df.FlightNumber.loc[i-1,] + 10

df['FlightNumber']
df

            From_To  FlightNumber  RecentDelays             Airline
1      LoNDon_paris       10045.0      [23, 47]              KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France>(12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
4    Budapest_PaRis       10075.0          [13]       12.Air France
5   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [39]:
# Changing the data type FlightNumber column to integer
df['FlightNumber'].astype(int)

1    10045
2    10055
3    10065
4    10075
5    10085
Name: FlightNumber, dtype: int64

## 2.  The From_To column would be better as two separate columns! Split each string on the
## underscore delimiter _ to give a new temporary DataFrame with the correct values
## Assign the correct column names to this temporary DataFrame.

In [40]:
df['From_To']

1        LoNDon_paris
2        MAdrid_miLAN
3    londON_StockhOlm
4      Budapest_PaRis
5     Brussels_londOn
Name: From_To, dtype: object

In [41]:
# Creating a new temporary dataframe which is a copy of existing dataframe df
temporarydf = df.copy()

In [42]:
# Splitting the column into two based on "_"
temporarydf[['From','To']] = temporarydf.From_To.str.split("_", expand = True)

In [47]:
# Printing the new dataframe
temporarydf

,From_To,FlightNumber,RecentDelays,Airline,From,To
1,London_paris,10045.0,"[23, 47]",KLM(!),London,Paris
2,Madrid_milan,10055.0,[],<Air France>(12),Madrid,Milan
3,London_stockholm,10065.0,"[24, 43, 87]",(British Airways.),London,Stockholm
4,Budapest_paris,10075.0,[13],12.Air France,Budapest,Paris
5,Brussels_london,10085.0,"[67, 32]",Swiss Air,Brussels,London

## 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [48]:
# Converting tne first letter of values in 'From' column into uppercase
temporarydf.From = temporarydf.From.str.capitalize()

In [49]:
# Converting the first letter of values in 'To' column into uppercase
temporarydf.To = temporarydf.To.str.capitalize()

In [50]:
# Converting the first letter of values in 'From_To' column into uppercase
temporarydf.From_To = temporarydf.From_To.str.capitalize()

In [51]:
print(temporarydf)

            From_To  FlightNumber  RecentDelays             Airline      From  \
1      London_paris       10045.0      [23, 47]              KLM(!)    London
2      Madrid_milan       10055.0            []    <Air France>(12)    Madrid
3  London_stockholm       10065.0  [24, 43, 87]  (British Airways.)    London
4    Budapest_paris       10075.0          [13]       12.Air France  Budapest
5   Brussels_london       10085.0      [67, 32]           Swiss Air  Brussels

          To
1      Paris
2      Milan
3  Stockholm
4      Paris
5     London

## 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions

In [52]:
# Printing the existing df
df

            From_To  FlightNumber  RecentDelays             Airline
1      LoNDon_paris       10045.0      [23, 47]              KLM(!)
2      MAdrid_miLAN       10055.0            []    <Air France>(12)
3  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
4    Budapest_PaRis       10075.0          [13]       12.Air France
5   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [53]:
# Printing the dataframe after deleting the 'From_To' column
df.drop('From_To', axis=1, inplace=True)

In [54]:
df

   FlightNumber  RecentDelays             Airline
1       10045.0      [23, 47]              KLM(!)
2       10055.0            []    <Air France>(12)
3       10065.0  [24, 43, 87]  (British Airways.)
4       10075.0          [13]       12.Air France
5       10085.0      [67, 32]           Swiss Air

In [55]:
# Adding the 'From_To' column from temporary database
df['From_To'] = temporarydf['From_To']
df

   FlightNumber  RecentDelays             Airline           From_To
1       10045.0      [23, 47]              KLM(!)      London_paris
2       10055.0            []    <Air France>(12)      Madrid_milan
3       10065.0  [24, 43, 87]  (British Airways.)  London_stockholm
4       10075.0          [13]       12.Air France    Budapest_paris
5       10085.0      [67, 32]           Swiss Air   Brussels_london

## 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

## Expand the Series of lists into a DataFrame named delays. rename the columns delay_1, delay_2 etc and replace the unwanted RecentDelays column in df with delays

In [56]:
# Using the original dataframe provided for this problem
df = pd.DataFrame({'From_To':['LoNDon_paris','MAdrid_miLAN', 'londON_StockhOlm', 'Budapest_PaRis', 'Brussels_londOn'],
                  'FlightNumber':[10045, np.nan, 10065, np.nan, 10085],'RecentDelays':[[23,47],[],[24,43,87],[13],[67,32]],
                  'Airline':['KLM(!)','<Air France>(12)','(British Airways.)','12.Air France', 'Swiss Air']})
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]       12.Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [60]:
rows = []
_ = df.apply(lambda row:[rows.append([row['Airline'], row['FlightNumber'],nn,row['From_To']]) for nn in row.RecentDelays], axis=1)

In [61]:
# Printing all values in recent delay column in separate rows
rows

[['KLM(!)', 10045.0, 23, 'LoNDon_paris'],
 ['KLM(!)', 10045.0, 47, 'LoNDon_paris'],
 ['(British Airways.)', 10065.0, 24, 'londON_StockhOlm'],
 ['(British Airways.)', 10065.0, 43, 'londON_StockhOlm'],
 ['(British Airways.)', 10065.0, 87, 'londON_StockhOlm'],
 ['12.Air France', nan, 13, 'Budapest_PaRis'],
 ['Swiss Air', 10085.0, 67, 'Brussels_londOn'],
 ['Swiss Air', 10085.0, 32, 'Brussels_londOn']]

In [62]:
# Converting the data into dataframe
df_new = pd.DataFrame(rows, columns = df.columns)

In [63]:
# Print the existing dataframe
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]       12.Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [64]:
# Printing the updated dataframe as per the criteria defined.
df_new

              From_To  FlightNumber  RecentDelays           Airline
0              KLM(!)       10045.0            23      LoNDon_paris
1              KLM(!)       10045.0            47      LoNDon_paris
2  (British Airways.)       10065.0            24  londON_StockhOlm
3  (British Airways.)       10065.0            43  londON_StockhOlm
4  (British Airways.)       10065.0            87  londON_StockhOlm
5       12.Air France           NaN            13    Budapest_PaRis
6           Swiss Air       10085.0            67   Brussels_londOn
7           Swiss Air       10085.0            32   Brussels_londOn

In [65]:
# Expand the series of lists into a Dataframe called delays, rename the columns delay_1, delay_2 etc and replace the unwanted 
# RecentDelays column in df with delays.

# Getting the recent delays from the dataframe
df3 = pd.DataFrame(df['RecentDelays'].values.tolist())
df3

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [66]:
length_columns =  df3.shape[1]
length_columns

3

In [67]:
df3.columns[0]

0

In [68]:
# Creating a for loop iteration for renaming the columns
columns_list= []
columns_dict= {}
for i in range(length_columns):
    key = df3.columns[i]
    value = 'Delay' + str(i+1)
    columns_dict[key] = value
columns_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [69]:
# Renaming the columns
df3.rename(columns=columns_dict, inplace=True)
df3

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [70]:
# Printing the existing dataframe for comparison
df

            From_To  FlightNumber  RecentDelays             Airline
0      LoNDon_paris       10045.0      [23, 47]              KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France>(12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways.)
3    Budapest_PaRis           NaN          [13]       12.Air France
4   Brussels_londOn       10085.0      [67, 32]           Swiss Air

In [71]:
df[['Delay1', 'Delay2', 'Delay3']] = df3[['Delay1', 'Delay2', 'Delay3']]

In [72]:
# Adding the new columns to the dataframe
df

,From_To,FlightNumber,RecentDelays,Airline,Delay1,Delay2,Delay3
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),23.0,47.0,NaN
1,MAdrid_miLAN,NaN,[],<Air France>(12),NaN,NaN,NaN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways.),24.0,43.0,87.0
3,Budapest_PaRis,NaN,[13],12.Air France,13.0,NaN,NaN
4,Brussels_londOn,10085.0,"[67, 32]",Swiss Air,67.0,32.0,NaN

In [73]:
# Printing the updated dataframe by dropping the recentdays column as specified in the problem
df.drop('RecentDelays', axis=1, inplace=True)
df

            From_To  FlightNumber             Airline  Delay1  Delay2  Delay3
0      LoNDon_paris       10045.0              KLM(!)    23.0    47.0     NaN
1      MAdrid_miLAN           NaN    <Air France>(12)     NaN     NaN     NaN
2  londON_StockhOlm       10065.0  (British Airways.)    24.0    43.0    87.0
3    Budapest_PaRis           NaN       12.Air France    13.0     NaN     NaN
4   Brussels_londOn       10085.0           Swiss Air    67.0    32.0     NaN